-- phpMyAdmin SQL Dump
-- version 5.1.2
-- https://www.phpmyadmin.net/
--
-- Хост: localhost:3306
-- Время создания: Июн 01 2023 г., 12:24
-- Версия сервера: 5.7.24
-- Версия PHP: 8.0.1

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `library`
--

-- --------------------------------------------------------

--
-- Структура таблицы `bookshop`
--

CREATE TABLE `bookshop` (
  `id` int(11) NOT NULL,
  `number` int(11) NOT NULL,
  `code` varchar(16) NOT NULL,
  `new` varchar(16) DEFAULT NULL,
  `name` varchar(128) DEFAULT NULL,
  `price` double DEFAULT NULL,
  `publishinghouse` varchar(64) NOT NULL,
  `pages` int(11) NOT NULL,
  `format` varchar(16) DEFAULT NULL,
  `dates` date DEFAULT NULL,
  `printing` varchar(16) NOT NULL,
  `theme` varchar(128) NOT NULL,
  `category` varchar(64) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `bookshop`
--

INSERT INTO `bookshop` (`id`, `number`, `code`, `new`, `name`, `price`, `publishinghouse`, `pages`, `format`, `dates`, `printing`, `theme`, `category`) VALUES
(1, 2, '5110', 'No', 'Апаратні засоби мультимедіа. Відеосистема РС', 15.51, 'Видавнича група BHV', 400, '70х100/16', '2000-07-24', '5000', 'Використання ПК в цілому', 'Підручники'),
(2, 8, '4985', 'No', 'Засвой самостійно модернізацію та ремонт ПК за 24 години, 2-ге вид.', 18.9, 'Вільямс', 288, '70х100/16', '2000-07-07', '5000', 'Використання ПК в цілому', 'Підручники'),
(3, 9, '5141', 'No', 'Структури даних та алгоритми', 37.8, 'Вільямс', 384, '70х100/16', '2000-09-29', '5000', 'Використання ПК в цілому', 'Підручники'),
(4, 20, '5127', 'No', 'Автоматизація інженерно-графічних робіт', 11.58, 'Видавнича група BHV', 256, '70х100/16', '2000-06-15', '5000', 'Використання ПК в цілому', 'Підручники'),
(5, 31, '5110', 'No', 'Апаратні засоби мультимедіа. Відеосистема РС', 15.51, 'Видавнича група BHV', 400, '70х100/16', '2000-07-24', '5000', 'Використання ПК в цілому', 'Апаратні засоби ПК'),
(6, 46, '5199', 'No', 'Залізо IBM 2001', 30.07, 'МикроАрт', 368, '70х100/16', '2000-02-12', '5000', 'Використання ПК в цілому', 'Апаратні засоби ПК'),
(7, 50, '3851', 'No', 'Захист інформації та безпека комп`ютерних систем', 26, 'DiaSoft', 480, '84х108/16', NULL, '5000', 'Використання ПК в цілому', 'Захист і безпека ПК'),
(8, 58, '3932', 'No', 'Як перетворити персональний комп`ютер на вимірювальний комплекс', 7.65, 'ДМК', 144, '60х88/16', '1999-06-09', '5000', 'Використання ПК в цілому', 'Інші книги'),
(9, 59, '4713', 'No', 'Plug-ins. Додаткові програми для музичних програм', 11.41, 'ДМК', 144, '70х100/16', '2000-02-22', '5000', 'Використання ПК в цілому', 'Інші книги'),
(10, 175, '5217', 'No', 'Windows МЕ. Найновіші версії програм', 16.57, 'Триумф ', 320, '70х100/16', '2000-08-25', '5000', 'Операційні системи', 'Windows 2000 '),
(11, 176, '4829', 'No', 'Windows 2000 Professional крок за кроком з CD', 27.25, 'Эком', 320, '70х100/16', '2000-04-28', '5000', 'Операційні системи', 'Windows 2000 '),
(12, 188, '5170', 'No', 'Linux Версії', 24.43, 'ДМК', 346, '70х100/16', '2000-09-29', '5000', 'Операційні системи', 'Linux'),
(13, 191, '860', 'No', 'Операційна система UNIX', 3.5, 'Видавнича група BHV', 395, '84х100/16', '1997-05-05', '5000', 'Операційні системи', 'Unix'),
(14, 203, '44', 'No', 'Відповіді на актуальні запитання щодо OS/2 Warp', 5, 'DiaSoft', 352, '60х84/16', '1996-03-20', '5000', 'Операційні системи', 'Інші операційні системи'),
(15, 206, '5176', 'No', 'Windows Ме. Супутник користувача', 12.79, 'Видавнича група BHV', 306, NULL, '2000-10-10', '5000', 'Операційні системи', 'Інші операційні системи'),
(16, 209, '5462', 'No', 'Мова програмування С++. Лекції та вправи', 29, 'DiaSoft', 656, '84х108/16', '2000-12-12', '5000', 'Програмування', 'C&C++'),
(17, 210, '4982', 'No', 'Мова програмування С. Лекції та вправи', 29, 'DiaSoft', 432, '84х108/16', '2000-07-12', '5000', 'Програмування', 'C&C++'),
(18, 220, '4687', 'No', 'Ефективне використання C++ .50 рекомендацій щодо покращення ваших програм та проектів', 17.6, 'ДМК', 240, '70х100/16', '2000-02-03', '5000', 'Програмування', 'C&C++'),
(19, 222, '235', 'No', 'Інформаційні системи і структури даних', NULL, 'Києво-Могилянська академія', 288, '60х90/16', NULL, '400', 'Використання ПК в цілому', 'Інші книги'),
(20, 225, '8746', 'Yes', 'Бази даних в інформаційних системах', NULL, 'Університет \"Україна\"', 418, '60х84/16', '2018-07-25', '100', 'Програмування', 'SQL'),
(21, 226, '2154', 'Yes', 'Сервер на основі операційної системи FreeBSD 6.1', 0, 'Університет \"Україна\"', 216, '60х84/16', '2015-11-03', '500', 'Програмування', 'Інші операційні системи'),
(22, 245, '2662', 'No', 'Організація баз даних та знань', 0, 'Вінниця: ВДТУ', 208, '60х90/16', '2001-10-10', '1000', 'Програмування', 'SQL'),
(23, 247, '5641', 'Yes', 'Організація баз даних та знань', 0, 'Видавнича група BHV', 384, '70х100/16', '2021-12-15', '5000', 'Програмування', 'SQL');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `bookshop`
--
ALTER TABLE `bookshop`
  ADD PRIMARY KEY (`id`),
  ADD KEY `CdIndex` (`code`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `bookshop`
--
ALTER TABLE `bookshop`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=24;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
